# Pandas

> pip install pandas

In [1]:
import pandas as pd
import numpy as np

C:\Users\Administrator\AppData\Local\Temp\ipykernel_7944\2937650959.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Creating of the DataFrame

### 1. From Dictionary

In [2]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"]
}

# Create DataFrame
df = pd.DataFrame(data)

# Show the top 5x records
df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   3    Sara
3   4    Lena
4   5   Julia

In [3]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame
df = pd.DataFrame(data)

# Show the top 5x records
df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [3]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame with different column order , or certain columns to be imported
df = pd.DataFrame(data, columns=["city",  "name"])

# Show the top 5x records
df.head()

     city    name
0  Berlin  Thomas
1  Berlin    Ingo
2  Berlin    Sara
3  Berlin    Lena
4  Berlin   Julia

## 2. From a list

In [5]:
my_list = [
    {"ID": 1, "name": "Thomas", "city": "Berlin"},
    {"ID": 2, "name": "Ingo", "city": "Berlin"},
    {"ID": 3, "name": "Sara", "city": "Berlin"}    
]

# Create a DataFrame
df = pd.DataFrame(my_list)

# Show the top 5x records
df.head()

   ID    name    city
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin

In [6]:
my_list = [
    [1, "Thomas", "Berlin"],
    [2, "Ingo", "Berlin"],
    [3, "Sara", "Berlin"],
]


df = pd.DataFrame(my_list, columns = ["SS", "AA", "BB"]) # Give  manual column names

# show top 5x rows
df.head()

   SS      AA      BB
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin

### 3. From JSON

In [7]:
data = {
    "AAAA" : {
        "11": 100,
        "12": 101,
        "23": 102,
    },
    "BBB": {
        "11": "Thomas",
        "12": "Ingo",
        "23" : "Lena",
    }
}

df = pd.DataFrame(data)

df.head()

    AAAA     BBB
11   100  Thomas
12   101    Ingo
23   102    Lena

# Indexing

Index: can have duplicates

In [8]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}




# Create DataFrame
df = pd.DataFrame(data, index = ["a", "b", "c", "d", "e"]) # give custom indexing

df.head()

   ID    name    city  score
a   1  Thomas  Berlin      3
b   2    Ingo  Berlin      5
c   3    Sara  Berlin      2
d   4    Lena  Berlin      7
e   5   Julia  Berlin      1

In [9]:
# After creating the DataFrame --> Speciify the index column

df2 = df.set_index("name")

df2.head()

        ID    city  score
name
Thomas   1  Berlin      3
Ingo     2  Berlin      5
Sara     3  Berlin      2
Lena     4  Berlin      7
Julia    5  Berlin      1

# Create DataFrame from external files

In [2]:
df = pd.read_csv("./my_data.csv")
# df = pd.read_csv("./my_data.csv", delimiter=";")
# df = pd.read_csv("./my_data.csv", delimiter="\t")

df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [14]:
# use specific column from csv file
df = pd.read_csv("./my_data.csv", index_col = 0) # 0: is the order of the column
df = pd.read_csv("./my_data.csv", index_col = "Product") # "product": is the column name of the wished index

df.head()

,Order ID,Quantity Ordered,Price Each,Order Date,Purchase Address
Product,,,,,
USB-C Charging Cable,176558,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
NaN,NaN,NaN,NaN,NaN,NaN
Bose SoundSport Headphones,176559,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
Google Phone,176560,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
Wired Headphones,176560,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [12]:
# After creating the dataframe --> change the index column
df2 = df.set_index("Order Date")
df2.head()

,Order ID,Quantity Ordered,Price Each,Purchase Address
Order Date,,,,
04/19/19 08:46,176558,2,11.95,"917 1st St, Dallas, TX 75001"
NaN,NaN,NaN,NaN,NaN
04/07/19 22:30,176559,1,99.99,"682 Chestnut St, Boston, MA 02215"
04/12/19 14:38,176560,1,600,"669 Spruce St, Los Angeles, CA 90001"
04/12/19 14:38,176560,1,11.99,"669 Spruce St, Los Angeles, CA 90001"

In [13]:
# Use Specific Column Names for my DataFrame

df = pd.read_csv("./my_data.csv", names= ("A", "B", "C", "D", "E", "F"))

df.head()

,A,B,C,D,E,F
0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,NaN,NaN,NaN,NaN,NaN,NaN
3,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
4,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [4]:
# Read only some columns
df = pd.read_csv("./my_data.csv", usecols = ["Order ID", "Product", "Price Each"])

df.head()

  Order ID                     Product Price Each
0   176558        USB-C Charging Cable      11.95
1      NaN                         NaN        NaN
2   176559  Bose SoundSport Headphones      99.99
3   176560                Google Phone        600
4   176560            Wired Headphones      11.99

# DataFrame Informaiton

In [6]:
df = pd.read_csv("./my_data.csv")

In [7]:
df.loc[df.duplicated() ].count()

Order ID            618
Product             618
Quantity Ordered    618
Price Each          618
Order Date          618
Purchase Address    618
dtype: int64

In [5]:
df.loc[ df["Product"] == "USB-C Charging Cable"  ].count()

Order ID            21903
Product             21903
Quantity Ordered    21903
Price Each          21903
Order Date          21903
Purchase Address    21903
dtype: int64

# Show Rows

In [16]:
df.head() # top 5x records
df.head(2) # top 2x records


df.tail() # Show the last 5x records
df.tail(3) # show the last 3x records


df.sample() # random 1x record
df.sample(3) # random 3x records

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
157287,261744,Wired Headphones,1,11.99,10/13/19 09:29,"975 Meadow St, New York City, NY 10001"
77029,150269,USB-C Charging Cable,1,11.95,01/31/19 18:18,"935 Cedar St, San Francisco, CA 94016"
145208,286529,27in FHD Monitor,1,149.99,11/21/19 07:20,"241 Ridge St, San Francisco, CA 94016"

In [5]:
""" 
- columns and datatypes
- count of rows (total)
- columns and non-null values
"""
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Order ID    186305 non-null  object
 1   Product     186305 non-null  object
 2   Price Each  186305 non-null  object
dtypes: object(3)
memory usage: 4.3+ MB

In [18]:
df.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

In [6]:
df.shape  # (row_count, column_count)

df.shape[0] # count of rows
df.shape[1] # count of columns

3

In [20]:
row_count, col_count = df.shape


print(row_count)
print(col_count)

186850
6

In [20]:
df.size # counf ot items ---> Achtung : only for non-null Values

934250

# Show columns

In [28]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [8]:
df["Product"]
df[ ["Product", "Price Each"]  ] # show Multi Columns

# Alternative --> onlny for columns names without spaces
df.Product

0               USB-C Charging Cable
1                                NaN
2         Bose SoundSport Headphones
3                       Google Phone
4                   Wired Headphones
                     ...
186845        AAA Batteries (4-pack)
186846                        iPhone
186847                        iPhone
186848        34in Ultrawide Monitor
186849          USB-C Charging Cable
Name: Product, Length: 186850, dtype: object

# Info about columns

In [12]:
#Unique values
print(df["Product"].unique()) # Get the unique values as an array including NaN

print(len(df["Product"].unique())) # 21x including None value

print(df["Product"].nunique()) # 20x returns the number of unique values without NAN/Null value

print(len(df["Order Date"].nunique()))

['USB-C Charging Cable' nan 'Bose SoundSport Headphones' 'Google Phone'
 'Wired Headphones' 'Macbook Pro Laptop' 'Lightning Charging Cable'
 '27in 4K Gaming Monitor' 'AA Batteries (4-pack)'
 'Apple Airpods Headphones' 'AAA Batteries (4-pack)' 'iPhone'
 'Flatscreen TV' '27in FHD Monitor' '20in Monitor' 'LG Dryer'
 'ThinkPad Laptop' 'Vareebadd Phone' 'LG Washing Machine'
 '34in Ultrawide Monitor' 'Product']
21
20

KeyError: 'Order Date'

In [35]:
# Count
#df["Product"].value_counts() # returns a Serie containting count of unique values and the number of records

df["Product"].count()# Count of EXISTING values (without NAN)

186305

In [13]:
# Checks
df["Product"].isnull() # for each row --> give True or False

df["Product"].isnull().sum() # if (True = 1) --> Sum all Trues , Sum all 1

545

In [15]:
df["Product"].is_unique # False
df["Order ID"].is_unique # False

False

## Exercise

Get unique values for each column and save it into a text file

In [15]:
# your code

for x in df:
   if df[x].is_unique == 0:
       print(x)

Order ID
Product
Quantity Ordered
Price Each
Order Date
Purchase Address

# Filter the Data

In [17]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame
df = pd.DataFrame(data)

df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [18]:
df["name"] == "Thomas"

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [31]:
df[   df["name"] == "Thomas"  ]

   ID    name    city  score
0   1  Thomas  Berlin      3

In [32]:
df[   df["city"] == "Berlin"  ]

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [33]:
df[   df["city"] == "Aachen"  ]

Empty DataFrame
Columns: [ID, name, city, score]
Index: []

In [34]:
df.loc[ df["name"] == "Thomas"    ]

   ID    name    city  score
0   1  Thomas  Berlin      3

In [35]:
# Combine multiple-conditions
df.loc[(df["name"] == "Thomas")    &   (df["city"] == "Berlin")] # and
df.loc[(df["name"] == "Thomas")    |   (df["city"] == "Berlin")] # or

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

# Loop over the dataframe

In [36]:
# Loop over the columns
for column in df:
    print(column)

ID
name
city
score

In [37]:
# loop over the rows
for index, row in df.iterrows():
    print(index)
    print(row) # columns name and value
    print()

0
ID            1
name     Thomas
city     Berlin
score         3
Name: 0, dtype: object

1
ID            2
name       Ingo
city     Berlin
score         5
Name: 1, dtype: object

2
ID            3
name       Sara
city     Berlin
score         2
Name: 2, dtype: object

3
ID            4
name       Lena
city     Berlin
score         7
Name: 3, dtype: object

4
ID            5
name      Julia
city     Berlin
score         1
Name: 4, dtype: object

In [38]:
# loop over the rows
for index, row in df.iterrows():
    print(index)
    print(row.values) # [1 'Thomas' 'Berlin' 3] without column names
    print()

0
[1 'Thomas' 'Berlin' 3]

1
[2 'Ingo' 'Berlin' 5]

2
[3 'Sara' 'Berlin' 2]

3
[4 'Lena' 'Berlin' 7]

4
[5 'Julia' 'Berlin' 1]

# Sorting

In [23]:
df.head()

   ID    name    city  score
1   2    Ingo  Berlin      5
4   5   Julia  Berlin      1
3   4    Lena  Berlin      7
2   3    Sara  Berlin      2
0   1  Thomas  Berlin      3

In [21]:
df = df.sort_values("name")

In [20]:
df_sorted = df.sort_values("name", ascending = False)
df_sorted.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1
1   2    Ingo  Berlin      5

In [24]:
# Sort by Index
df = df.sort_index()
df.sort_index(inplace=True)

df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

# Concatenate several dataFrames

In [26]:
data1 = {
    "ID": [1,2],
    "name": ["Thomas", "Ingo"],
    "city" : "Berlin" # same value for all rows
}

data2 = {
    "ID": [3,4],
    "name": ["Julia", "Lena"],
    "city" : "Aachen" # same value for all rows
}

data3 = {
    "ID": [5,6,7],
    "name": ["Frank", "Mattias", "Alex"],
    "city" : "Frankfurt" # same value for all rows
}



df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3= pd.DataFrame(data3)

In [27]:
df = pd.concat( [df1, df2, df3] )

df.head(6)

   ID     name       city
0   1   Thomas     Berlin
1   2     Ingo     Berlin
0   3    Julia     Aachen
1   4     Lena     Aachen
0   5    Frank  Frankfurt
1   6  Mattias  Frankfurt

In [29]:
df = pd.concat( [df1, df2, df3], axis = 1 ) # next to each other
df.head(6)


df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      2 non-null      float64
 1   name    2 non-null      object
 2   city    2 non-null      object
 3   ID      2 non-null      float64
 4   name    2 non-null      object
 5   city    2 non-null      object
 6   ID      3 non-null      int64
 7   name    3 non-null      object
 8   city    3 non-null      object
dtypes: float64(2), int64(1), object(6)
memory usage: 348.0+ bytes

# Data Types

In [46]:
data = {
    "ID": ["1","2","3"],
    "name": ["Thomas", "Ingo", "Sara"],
    "score": ["12.2", "13.3", "14.4"]
}

df = pd.DataFrame(data)

df.head()

  ID    name score
0  1  Thomas  12.2
1  2    Ingo  13.3
2  3    Sara  14.4

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      object
 1   name    3 non-null      object
 2   score   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [48]:
df.describe()

       ID    name score
count   3       3     3
unique  3       3     3
top     1  Thomas  12.2
freq    1       1     1

In [49]:
# Manual Custom
df["ID"] = df["ID"].astype(int)
df["score"] = df["score"].astype(float)

In [50]:
# Alternative
#~~~~~~~~~~~~~

df["ID"] = pd.to_numeric(df["ID"])
df["score"] = pd.to_numeric(df["score"])

# Save to _CSV File

In [51]:
df.to_csv("output.csv") # with index column
df.to_csv("output.csv", index = False) # without index column
df.to_csv("output.csv", index = False, sep = ";") # without index column , with ; instead of comma

# Drop

In [52]:
data = {
    "ID": [1,2,3,4,5,6,7],
    "name" : ["Thomas", "Ingo", "Sara", "Lena", "Julia", "Frank", "Matthias"],
    "city": "Berlin"
}

df = pd.DataFrame(data)


df.head()

   ID    name    city
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin
3   4    Lena  Berlin
4   5   Julia  Berlin

In [53]:
# Drop Columns 
df.drop(columns = ["ID"])
df.drop(columns = ["ID", "name"])

     city
0  Berlin
1  Berlin
2  Berlin
3  Berlin
4  Berlin
5  Berlin
6  Berlin

In [54]:
df.drop(index = [1, 3])

   ID      name    city
0   1    Thomas  Berlin
2   3      Sara  Berlin
4   5     Julia  Berlin
5   6     Frank  Berlin
6   7  Matthias  Berlin

In [55]:
# index = 900 does not exists --> will throw and error --> "ingore" will ingore the error
df.drop(index = [1, 3, 900], errors ="ignore")

   ID      name    city
0   1    Thomas  Berlin
2   3      Sara  Berlin
4   5     Julia  Berlin
5   6     Frank  Berlin
6   7  Matthias  Berlin

# DropNA

In [56]:
import numpy as np

In [20]:
data = {
    "ID": [1, np.nan,np.nan ,np.nan,5,6,np.nan],
    "name": [np.nan, "Ingo", np.nan, "Lena", "Julia", "Frank", np.nan],
    "city": np.nan
}


df = pd.DataFrame(data)

df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [58]:
df.dropna(axis = "columns", how ="all")  # -> same like 'city' column

    ID   name
0  1.0    NaN
1  NaN   Ingo
2  NaN    NaN
3  NaN   Lena
4  5.0  Julia
5  6.0  Frank
6  NaN    NaN

In [59]:
df.dropna(axis = "columns", how ="any")  # -> same like all columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [8]:
df.dropna(axis = "rows", how ="all")

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
5,176561,Wired Headphones,1,11.99,04/30/19 09:27,"333 8th St, Los Angeles, CA 90001"
...,...,...,...,...,...,...
186845,259353,AAA Batteries (4-pack),3,2.99,09/17/19 20:56,"840 Highland St, Los Angeles, CA 90001"
186846,259354,iPhone,1,700,09/01/19 16:00,"216 Dogwood St, San Francisco, CA 94016"
186847,259355,iPhone,1,700,09/23/19 07:39,"220 12th St, San Francisco, CA 94016"
186848,259356,34in Ultrawide Monitor,1,379.99,09/19/19 17:30,"511 Forest St, San Francisco, CA 94016"
186849,259357,USB-C Charging Cable,1,11.95,09/30/19 00:18,"250 Meadow St, San Francisco, CA 94016"

In [9]:
df.loc[df.duplicated() ].count()

Order ID            618
Product             618
Quantity Ordered    618
Price Each          618
Order Date          618
Purchase Address    618
dtype: int64

In [24]:
# consider only specific columns
df.dropna(axis = "rows", how ="all", subset =[ "name", "ID"])

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN
5  6.0  Frank   NaN

# FillNA

In [62]:
data = {
    "ID": [1, np.nan,np.nan ,np.nan,5,6,np.nan],
    "name": [np.nan, "Ingo", np.nan, "Lena", "Julia", "Frank", np.nan],
    "city": np.nan
}


df = pd.DataFrame(data)

df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [63]:
# fill with specific value
df.fillna(0)

    ID   name  city
0  1.0      0   0.0
1  0.0   Ingo   0.0
2  0.0      0   0.0
3  0.0   Lena   0.0
4  5.0  Julia   0.0
5  6.0  Frank   0.0
6  0.0      0   0.0

In [26]:
# fill each colum with specific value
df.fillna({
    "ID": 999,
    "name" : "Not found",
    "city": "Berlin"

})

      ID       name    city
0    1.0  Not found  Berlin
1  999.0       Ingo  Berlin
2  999.0  Not found  Berlin
3  999.0       Lena  Berlin
4    5.0      Julia  Berlin
5    6.0      Frank  Berlin
6  999.0  Not found  Berlin

In [65]:
df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [27]:
df.fillna(method = "ffill") # ffill: forward fill
df.fillna(method = "bfill") # bfill: backward fill

# columnwise
df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
df.fillna(method = "ffill", axis = "columns") # ffill: forward fill

C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill") # ffill: forward fill
C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "bfill") # bfill: backward fill
C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:5: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", axis = "columns") # ffill: forward fill
C:\Users\Administrator\AppData\Local\Temp\ipykernel_10100\55942426.py:6: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = "ffill", axis = "columns") # ffill: forward fill

    ID   name   city
0  1.0    1.0    1.0
1  NaN   Ingo   Ingo
2  NaN    NaN    NaN
3  NaN   Lena   Lena
4  5.0  Julia  Julia
5  6.0  Frank  Frank
6  NaN    NaN    NaN

# Example of filling values

In [67]:
data = {
    "ID": [1, np.nan, 2, np.nan, 3,4,5],
    "name": ["Thomas", "Thomas", "Ingo",np.nan , "Sara", "Julia","Thomas"],
    "score" : [25,np.nan , np.nan, 14, 64,21,14]
}

df = pd.DataFrame(data)


df.head()

    ID    name  score
0  1.0  Thomas   25.0
1  NaN  Thomas    NaN
2  2.0    Ingo    NaN
3  NaN     NaN   14.0
4  3.0    Sara   64.0

In [68]:
df["ID"] = df["ID"].interpolate() # Achtung: macht kein Sinn fr Interpolation --> only a demo

# Get the most freq name
most_freq_name = df["name"].mode()[0]

# Get tthe mean of the score
mean_score = df["score"].mean()


df.fillna({
    "name": most_freq_name,
    "score" : mean_score
})

    ID    name  score
0  1.0  Thomas   25.0
1  1.5  Thomas   27.6
2  2.0    Ingo   27.6
3  2.5  Thomas   14.0
4  3.0    Sara   64.0
5  4.0   Julia   21.0
6  5.0  Thomas   14.0

# Duplicate

In [28]:
data = {
    "ID": [1,2, 2, 4, 4],
    "name" : ["Thomas", "Ingo", "Ingo", "Lena", "Lena"]
    
}

df = pd.DataFrame(data)

df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   2    Ingo
3   4    Lena
4   4    Lena

In [32]:
#df.duplicated()
df.duplicated(keep = "first") # default
df.duplicated(keep = "last") # default

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [71]:
df.loc[df.duplicated() ]

   ID  name
2   2  Ingo
4   4  Lena

# drop_duplicates()

In [72]:
data = {
    "ID": [1,2, 2, 4, 4],
    "name" : ["Thomas", "Ingo", "Ingo", "Lena", "Lena"]
    
}

df = pd.DataFrame(data)

df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   2    Ingo
3   4    Lena
4   4    Lena

In [73]:
df.drop_duplicates() # with keep = first default
df.drop_duplicates(keep = "last") 
df.drop_duplicates(subset = ["name", "ID"]) # only consider these columns to drop the duplicates

   ID    name
0   1  Thomas
1   2    Ingo
3   4    Lena